Repository: sonrohan/diffuse
Catalog: Chobi/Localizable.xcstrings
Source language: en
Languages: es, fr, ru

source: A deterministic PR review triage tool. Analyze any local git repo to get started.
es: Una herramienta determinista de triaje para revisión de PR. Analice cualquier repositorio local de Git para comenzar.
fr: Un outil déterministe de tri pour la révision de PR. Analysez un dépôt Git local pour commencer.
ru: Детерминированный инструмент для разбора пулл-реквестов. Проанализируйте любой локальный репозиторий Git для начала.

source: Active (Local)
es: Activo (Local)
fr: Actif (Local)
ru: Активен (Локально)

source: Active Workspace:
es: Espacio de Trabajo Activo:
fr: Espace de travail actif :
ru: Активная рабочая область:

source: Add Workspace…
es: Agregar Espacio de Trabajo…
fr: Ajouter un espace de travail…
ru: Добавить рабочую область…

source: All
es: Todo
fr: Tout
ru: Все

source: All Changes
es: Todos los Cambios
fr: Tous les changements
ru: Все изменения

source: Analyze
es: Analizar
fr: Analyser
ru: Анализировать

source: Analyze latest
es: Analizar lo último
fr: Analyser le dernier
ru: Анализировать последние изменения

source: Analyze Local Repo
es: Analizar Repositorio Local
fr: Analyser un dépôt local
ru: Анализ локального репозитория

source: Analyzing…
es: Analizando…
fr: Analyse en cours…
ru: Выполняется анализ…

source: App Language
es: Idioma de la Aplicación
fr: Langue de l'application
ru: Язык приложения

source: Appearance
es: Apariencia
fr: Apparence
ru: Внешний вид

source: Are you sure you want to remove this workspace?
es: ¿Está seguro de que desea eliminar este espacio de trabajo?
fr: Êtes-vous sûr de vouloir retirer cet espace de travail ?
ru: Вы уверены, что хотите удалить эту рабочую область?

source: AST Analysis Engine
es: Motor de Análisis AST
fr: Moteur d'analyse AST
ru: Анализатор кода AST

source: Auto-analyze local changes while app is open
es: Analizar automáticamente los cambios locales mientras la aplicación esté abierta
fr: Analyser automatiquement les modifications locales lorsque l'application est ouverte
ru: Автоматически анализировать локальные изменения при открытом приложении

source: Base Ref (optional)
es: Referencia Base (opcional)
fr: Réf de base (optionnel)
ru: Базовая ветка/SHA (опционально)

source: Browse…
es: Examinar…
fr: Parcourir…
ru: Обзор…

source: Cancel
es: Cancelar
fr: Annuler
ru: Отмена

source: Choose your preferred aesthetic style for chobi.
es: Elija su estilo estético preferido para chobi.
fr: Choisissez votre style esthétique préféré pour chobi.
ru: Выберите предпочтительный стиль оформления для chobi.

source: Clear All Local Data
es: Borrar Todos los Datos Locales
fr: Effacer toutes les données locales
ru: Удалить все локальные данные

source: Clear Cache…
es: Borrar Caché…
fr: Effacer le cache…
ru: Очистить кэш…

source: Clear the local workspace analyses and persistent triage cache database.
es: Borrar los análisis de espacios de trabajo locales y la base de datos de caché persistente.
fr: Effacer les analyses d'espaces de travail et la base de données de cache.
ru: Очистить результаты анализа локальных рабочих областей и базу данных кэша.

source: Done
es: Aceptar
fr: Terminé
ru: Готово

source: Enable Live Auto-Analysis
es: Activar Auto-Análisis en Vivo
fr: Activer l'auto-analyse en direct
ru: Включить автоматический анализ на лету

source: Folder Path
es: Ruta de la Carpeta
fr: Chemin du dossier
ru: Путь к папке

source: Live
es: En Vivo
fr: Direct
ru: Лайв

source: Loading analysis…
es: Cargando análisis…
fr: Chargement de l'analyse…
ru: Загрузка результатов анализа…

source: Manage paths, aliases, and auto-analysis toggles for active workspaces.
es: Gestione rutas, alias y análisis automáticos para los espacios de trabajo activos.
fr: Gérerez les chemins, les alias et les analyses automatiques pour vos espaces de travail.
ru: Настройка путей, псевдонимов и автоанализа для активных рабочих областей.

source: Next Commit
es: Commit Siguiente
fr: Commit suivant
ru: Следующий коммит

source: No PR selected
es: Ningún PR seleccionado
fr: Aucune PR sélectionnée
ru: Пул-реквест не выбран

source: Open in Finder
es: Abrir en Finder
fr: Ouvrir dans le Finder
ru: Открыть в Finder

source: Parses symbols and signatures locally using high-fidelity Tree-sitter AST parsers. No code is sent to external APIs.
es: Analiza símbolos y firmas localmente usando analizadores AST Tree-sitter de alta fidelidad. No se envía código a APIs externas.
fr: Analyse les symboles et les signatures localement avec des analyseurs AST Tree-sitter. Aucun code n'est envoyé à des API externes.
ru: Разбирает символы и сигнатуры локально с помощью парсеров AST Tree-sitter. Код не отправляется на внешние API.

source: Previous Commit
es: Commit Anterior
fr: Commit précédent
ru: Предыдущий коммит

source: Remove from chobi
es: Eliminar de chobi
fr: Retirer de chobi
ru: Удалить из chobi

source: Remove Workspace
es: Eliminar Espacio de Trabajo
fr: Retirer l'espace de travail
ru: Удалить рабочую область

source: Rename
es: Renombrar
fr: Renommer
ru: Переименовать

source: Rename Workspace
es: Renombrar Espacio de Trabajo
fr: Renommer l'espace de travail
ru: Переименовать рабочую область

source: Rename Workspace…
es: Renombrar Espacio de Trabajo…
fr: Renommer l'espace de travail…
ru: Переименовать рабочую область…

source: Repository Path
es: Ruta del Repositorio
fr: Chemin du dépôt
ru: Путь к репозиторию

source: Run chobi analysis on a local git repository.
es: Ejecute el análisis de chobi en un repositorio local de Git.
fr: Lancez l'analyse chobi sur un dépôt Git local.
ru: Запустите анализ chobi для локального репозитория Git.

source: Running analysis…
es: Ejecutando análisis…
fr: Analyse en cours…
ru: Выполняется анализ…

source: Select a folder…
es: Seleccione una carpeta…
fr: Sélectionnez un dossier…
ru: Выберите папку…

source: Select a workspace or branch to load analysis.
es: Seleccione un espacio de trabajo o rama para cargar el análisis.
fr: Sélectionnez un espace de travail ou une branche pour charger l'analyse.
ru: Выберите рабочую область или ветку для загрузки анализа.

source: Select Workspace
es: Seleccionar Espacio de Trabajo
fr: Sélectionner un espace de travail
ru: Выбрать рабочую область

source: Select your preferred display language for UI labels and triage summaries.
es: Seleccione su idioma preferido para las etiquetas de la interfaz y resúmenes.
fr: Sélectionnez votre langue d'affichage préférée pour les étiquettes et les résumés.
ru: Выберите предпочтительный язык интерфейса для меток и сводок.

source: Settings
es: Ajustes
fr: Paramètres
ru: Настройки

source: Storage & Cache
es: Almacenamiento y Caché
fr: Stockage et cache
ru: Хранилище и кэш

source: Theme Selection
es: Selección de Tema
fr: Sélection du thème
ru: Выбор темы

source: This will delete all analyzed local repository pull requests from the application store. This action cannot be undone.
es: Esto eliminará todos los análisis de pull requests locales almacenados. Esta acción no se puede deshacer.
fr: Cela supprimera toutes les analyses locales de pull requests. Cette action est irréversible.
ru: Это удалит результаты анализа локальных репозиториев из приложения. Данное действие нельзя отменить.

source: This will remove the workspace from chobi. Your local Git repository and files will not be deleted.
es: Esto eliminará el espacio de trabajo de chobi. Su repositorio Git local y sus archivos no se eliminarán.
fr: Cela retirera l'espace de travail de chobi. Votre dépôt Git local et vos fichiers ne seront pas supprimés.
ru: Это удалит рабочую область из chobi. Локальный репозиторий Git и ваши файлы не будут удалены.

source: This will remove the workspace from chobi. Your local Git repository and files will remain intact.
es: Esto eliminará el espacio de trabajo de chobi. Su repositorio local de Git y sus archivos permanecerán intactos.
fr: Cela retirera l'espace de travail de chobi. Votre dépôt Git local et vos fichiers resteront inchangés.
ru: Это удалит рабочую область из chobi. Локальный репозиторий Git и ваши файлы останутся нетронутыми.

source: Turn Off Auto-Analyze
es: Desactivar Auto-Análisis
fr: Désactiver l'auto-analyse
ru: Выключить автоанализ

source: Turn On Auto-Analyze
es: Activar Auto-Análisis
fr: Activer l'auto-analyse
ru: Включить автоанализ

source: Use ⌘O or the header dropdown to analyze a local repo.
es: Use ⌘O o el menú desplegable del encabezado para analizar un repositorio local.
fr: Utilisez ⌘O ou le menu déroulant d'en-tête pour analyser un dépôt local.
ru: Используйте ⌘O или выпадающее меню в заголовке, чтобы проанализировать локальный репозиторий.

source: Welcome to chobi
es: Bienvenido a chobi
fr: Bienvenue sur chobi
ru: Добро пожаловать в chobi

source: Workspace Alias
es: Alias del Espacio de Trabajo
fr: Alias de l'espace de travail
ru: Псевдоним рабочей области

source: Workspace Management
es: Gestión de Espacios de Trabajo
fr: Gestion des espaces de travail
ru: Управление рабочими областями

source: Workspace Name
es: Nombre del Espacio de Trabajo
fr: Nom de l'espace de travail
ru: Имя рабочей области

source: Workspace name...
es: Nombre del espacio de trabajo...
fr: Nom de l'espace de travail...
ru: Название рабочей области...

source: Workspaces
es: Espacios de Trabajo
fr: Espaces de travail
ru: Рабочие пространства

source: General
fr: Général
ru: Общие
